{
    "internationalizations": [
        {
            "language": "pt",
            "description": "Minha caminhada como <i>programador</i> teve início aos nove anos de idade quando me apaixonei pelo <i>Logo</i>, uma linguagem de programação educacional usada para cativar crianças nas maravilhosas terras da <i>Programação</i>. Costumava passar horas seguidas tentando criar figuras e animações, usando matemática e geometria. Naquela época, eu simplesmente não conhecia os desafios emocionantes que ainda estavam por vir.<br><br>Alguns anos depois, consegui um estágio como <i>Webmaster</i>, desde então, nunca mais parei, sendo mais de uma década, onde venho tendo a chance de trabalhar com pessoas maravilhosas, aprendendo todos os dias, viajando pelo mundo e, principalmente, sempre fazendo grandes amizades.<br><br>Tive experiência como empreendedor, quando um amigo apresentou-me <i>Magento</i>, um framework de comércio eletrônico extremamente popular. Depois de fazer vários cursos e muita prática, consegui contratos com agências de São Paulo e Rio de Janeiro, Brasil. Essa experiência de empreendedorismo me deu a chance de ver o outro lado da moeda, o que contribuiu para expandir um pouco mais minha consciência como colaborador.<br><br>Atualmente, continuo buscando novas habilidades, aprendendo e compartilhando meu humilde conhecimento, tanto quanto possível."
        },
        {
            "language": "en",
            "description": "I am a Year 4 undergraduate student majoring in <i>Food and Nutritional Sciences</i> at Macau University of Science and Technology, with a GPA of 3.61/4.0 (top 10% of my major). My studies focus on clinical nutrition, food chemistry and analysis, food processing and packaging, and community nutrition.<br><br>I have taken part in research projects on seasonal and follow-up factors in hypertension, metabolite analysis of traditional Chinese medicinal materials using R, and nutrient stability and heat-induced release in plant-based meat analogues. Clinically, I interned at Qilu Hospital's Health Management Center and Clinical Nutrition Department, working on health data collection, dietary interventions, and diabetes nutrition education. In industry, I interned at Wincom Group's Medical Department, adjusting high-protein meal plans and conducting market analysis of weight-loss foods and GLP-1-related platforms.<br><br>I am a native Mandarin speaker and fluent in English (TOEFL 96). My skills include literature management with EndNote, academic searching via Web of Science, data handling and statistics with Excel and basic SPSS, and introductory R programming for metabolomics, alongside experience in science communication and nutrition outreach.<br><br>I hope you can choose me because I will strengthen your program's link between clinical practice, community health, and evidence‑based nutrition. I can translate hospital and weight‑management experience into rigorous research questions, and I am already trained to handle nutritional data with scientific tools and critical thinking. I bring a clear focus on diet‑related chronic diseases and plant‑based nutrition, plus proven initiative in academic projects and outreach. You will gain a student who not only succeeds in coursework, but actively advances your lab's research output and public‑facing impact in nutrition.<br><br>Paper: <a href=\"https://www.kdocs.cn/l/ckergF6vd62J?f=301\" target=\"_blank\"><i>Food Chemistry</i></a> (under review)"
        }
    ],
    "hobbies": [        
        {
            "icon": "biking",
            "title": "Cycling"
        },
        {
            "icon": "dumbbell",
            "title": "Gym"
        },
        {
            "icon": "suitcase-rolling",
            "title": "Travel"
        },
        {
            "icon": "book",
            "title": "Read"
        }
    ]
}