[
    {
        "thumbnail": "assets/posts/post-11-03-2019.jpg",
        "http": "https://www.linkedin.com/pulse/anti-traversing-2d-array-formula-guilherme-borges-bastos/",
        "date": "11-03-2019",
        "internationalizations": [
            {
                "language": "en",
                "title": "The anti-traversing 2D Array formula.",
                "description": "Have you ever thought about the <b>mathematical relation</b> between the <i>columns</i> and <i>rows</i> of a bidimensional array <i>(2d matrix)</i>? This data structure hides a <b>data location formula</b> that helped me to avoid the <i>time complexity of O(n²)</i>, which is a terrible scenario, turning it into a <i>constant time complexity - O(1)</i>. A full explanation, with real test cases and Unit Tests are waiting for you."
            },
            {
                "language": "pt",
                "title": "A fórmula de matriz 2D anti-deslocamento.",
                "description": "Você já pensou na <b>relação matemática</b> entre as<i> colunas</i> e as <i>linhas</i> de uma matriz bidimensional <i>(matriz 2d)</i>? Essa estrutura de dados oculta uma <b>fórmula de localização de dados</b> que me ajudou a evitar a <i>complexidade de tempo de O(n²)</i>, que é um cenário péssimo, transformando-a em uma <i>complexidade do tempo constante - O(1)</i>. Uma explicação completa, com casos de teste reais e testes de unidade, está esperando por você."
            }
        ]
    },
    {
        "thumbnail": "assets/posts/post-01-15-2019.jpg",
        "http": "https://www.linkedin.com/pulse/em-2019-saia-do-desemprego-seja-voc%C3%AA-um-web-developer-borges-bastos/",
        "date": "01-15-2019",
        "internationalizations": [
            {
                "language": "en",
                "title": "In 2019, get out of unemployment! Be a Web Developer.",
                "description": "There were numerous vacancies for <i>web developers</i> on the wall, at the same time, <b>12.7 million people were unemployed</b> in Brazil, such a sad situation persisted in my mind. Back at my house, I've recalled a free course, offered by the renowned <i>Bob Tabor (Senior Program Manager at Microsoft)</i>, present at Microsoft Virtual Academy."
            },
            {
                "language": "pt",
                "title": "Em 2019, saia do desemprego! Seja você um Web Developer.",
                "description": "Lá estavam no mural, inúmeras vagas para desenvolvedor web. E ao mesmo tempo, haviam <b>12,7 Milhões de compatriotas desempregados</b> e tais vagas em aberto ficaram matutando em minha cabeça. De volta à minha casa, me recordo de um curso gratuito, disponibilizado pelo renomado <i>Bob Tabor (Senior Program Manager na Microsoft)</i>, presente na Microsoft Virtual Academy."
            }
        ]
    },
    {
        "thumbnail": "assets/posts/post-07-10-2016.jpg",
        "http": "https://www.linkedin.com/pulse/map-item-navigation-android-opensource-en-guilherme-borges-bastos/",
        "date": "07-10-2016",
        "internationalizations": [
            {
                "language": "en",
                "title": "Map Item Navigation for Android - <i>Open-source component</i>.",
                "description": "For great user experience, the usage of maps together with the ordered list is used very often in mobile applications. This article presents an open-source application for Android that provides a fully functional component."
            },
            {
                "language": "pt",
                "title": "Navegação por Item no Mapa para Android - <i>Componente de código aberto</i>.",
                "description": "Para uma ótima experiência do usuário, o uso de mapas junto com a lista ordenada é usado com muita frequência em aplicativos móveis. Este artigo apresenta um aplicativo de código aberto para Android que fornece um componente totalmente funcional."
            }
        ]
    },
    {
        "thumbnail": "assets/posts/post-05-07-2016.jpg",
        "http": "https://www.linkedin.com/pulse/geo-distance-search-mysql-php-guilherme-borges-bastos/",
        "date": "05-07-2016",
        "internationalizations": [
            {
                "language": "en",
                "title": "Geo Distance search with MySQL & PHP.",
                "description": "Nowadays, <b>geolocation</b> is essential for most of the basic daily activities. Who never have asked Google where is the closest market?  In this article, I show a practical example of how to create a <i>SQL Query</i> that does a geolocational search based on a radius range and a fixed geolocational point."
            },
            {
                "language": "pt",
                "title": "Pesquisa por distância geográfica com MySQL e PHP.",
                "description": "Atualmente, a <b>geolocalização</b> é essencial para a maioria das atividades diárias básicas. Quem nunca perguntou ao Google onde está o mercado mais próximo? Neste artigo, mostro um exemplo prático de como criar uma <i>consulta SQL</i> a qual faz uma pesquisa geolocalizada com base em um raio de abrangência e um ponto geográfico fixo."
            }
        ]
    }
]
